In [8]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [9]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)), 
                   columns=list('bde'),
                   index=['Ohio', 'Texas', 'Utah', 'Orengon'])

frame

         b   d   e
Ohio     0   1   2
Texas    3   4   5
Utah     6   7   8
Orengon  9  10  11

In [10]:
series = frame.iloc[0]
series

b    0
d    1
e    2
Name: Ohio, dtype: int32

In [13]:
frame - series

         b  d  e
Ohio     0  0  0
Texas    3  3  3
Utah     6  6  6
Orengon  9  9  9

In [19]:
series2 = pd.Series(np.arange(3), index=list('bef'))
frame + series2

           b   d     e   f
Ohio     0.0 NaN   3.0 NaN
Texas    3.0 NaN   6.0 NaN
Utah     6.0 NaN   9.0 NaN
Orengon  9.0 NaN  12.0 NaN

In [20]:
series3 = frame['d']
series3

Ohio        1
Texas       4
Utah        7
Orengon    10
Name: d, dtype: int32

In [21]:
frame.sub(series3, axis='index')

         b  d  e
Ohio    -1  0  1
Texas   -1  0  1
Utah    -1  0  1
Orengon -1  0  1